import random
def alligator_game():
    print("억아게임입니다.")
    status = ["01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12", "13", "14", "15", "16", "17", "18",
              "19", "20"]


    bomb = random.randrange(1,21)
    # print("벌칙수!!! {0}".format(bomb))

    input_number = -1



    while True:
        input_number = int(input("누를 이빨을 입력해주세요.(숫자로 입력) : "))
        if input_number != bomb :
            status[input_number-1]=" "
            print('''
                      --------                      --------
                            0                       0
              --------------------------------------------------------
                        O                               O
            ============================================================
            | {0} || {1} || {2} || {3} || {4} || {5} || {6} || {7} || {8} || {9} |
            ------------------------------------------------------------
        
            ------------------------------------------------------------
            | {10} || {11} || {12} || {13} || {14} || {15} || {16} || {17} || {18} || {19} |
            ============================================================
            '''.format(status[0], status[1], status[2], status[3], status[4],
                       status[5], status[6], status[7], status[8], status[9],
                       status[10], status[11], status[12], status[13], status[14],
                       status[15], status[16], status[17], status[18], status[19]))
        else:
            print("걸렸습니다.")
            break

